In [1]:
import numpy as np
import pandas as pd

In [8]:
labels = ["Dishwasher", "Laptop", "Iphone"]
prices = [399, 129, 123]

# combine two lists into one using a pandas series
ser1 = pd.Series(prices, labels)
ser1.to_frame()

              0
Dishwasher  399
Laptop      129
Iphone      123

In [11]:
d = {"a": 19, "b": 20, "c": 21}
ser1 = pd.Series(d)
ser1.to_frame()

    0
a  19
b  20
c  21

In [15]:
# combine 2 series
ser1 = pd.Series([1, 2, 3, 4], ["Finland", "Portugal", "Norwegian", "Denmark"])
ser2 = pd.Series([1, 2, 3, 4], ["Oulu", "Lisbon", "Norwegian", "Denmark"])
combined = ser1 + ser2
combined.to_frame()

# we have NaN because text + number

             0
Denmark    8.0
Finland    NaN
Lisbon     NaN
Norwegian  6.0
Oulu       NaN
Portugal   NaN